Revit 2023 API
IFCAggregate.CreateValueOfType Method
 Creates an ifc object with primitive type of aggregate's item type. This method is deprecated in Revit 2023 and may be removed in a later version of Revit. In Revit 2023 use addValueOfType instead.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2022.1
Syntax
C#
[ObsoleteAttribute]
public IFCData CreateValueOfType(
	string typeName
)
Visual Basic
<ObsoleteAttribute> _
Public Function CreateValueOfType ( _
	typeName As String _
) As IFCData
Visual C++
[ObsoleteAttribute]
public:
IFCData^ CreateValueOfType(
	String^ typeName
)
Parameters
typeName
Type: System.String
 The type name.
Return Value
 The IFCData object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The aggregate is not valid.
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace